{
  "1": {
    "role": "professor",
    "created_at": "2025-07-31T00:39:46.708807",
    "extracted_info": {
      "documents": [
        {
          "filename": "P3_Course.pdf",
          "uploaded_at": "2025-07-31T00:46:41.418445",
          "size": 0
        }
      ],
      "google_scholar": [
        {
          "url": "https://scholar.google.com/citations?user=fcbh--sAAAAJ&hl=en",
          "scraped_at": "2025-07-31T00:42:21.504804",
          "profile_data": {
            "name": "Nada Sharaf",
            "affiliation": "Lecturer at the German International University, German University in Cairo",
            "research_interests": [
              "Visualization",
              "Gamification",
              "Smart Adaptive Education",
              "Arabic Language Processing",
              "Industry 5.0"
            ],
            "publications": [
              {
                "title": "MiniColon; teaching kids computational thinking using an interactive serious game",
                "authors": "R Ayman, N Sharaf, G Ahmed, S Abdennadher",
                "citations": 39
              },
              {
                "title": "Codaroutine: A serious game for introducing sequential programming concepts to children with autism",
                "authors": "M Elshahawy, K Aboelnaga, N Sharaf",
                "citations": 29
              },
              {
                "title": "Developing computational thinking for children with autism using a serious game",
                "authors": "M Elshahawy, M Bakhaty, N Sharaf",
                "citations": 22
              },
              {
                "title": "Chranimation: An animation tool for constraint handling rules",
                "authors": "N Sharaf, S Abdennadher, T Frühwirth",
                "citations": 18
              },
              {
                "title": "Visualization of CHR through source-to-source transformation",
                "authors": "S Abdennadher, N Sharaf",
                "citations": 18
              },
              {
                "title": "AraScore: A deep learning-based system for Arabic short answer scoring",
                "authors": "O Nael, Y ELmanyalawy, N Sharaf",
                "citations": 16
              },
              {
                "title": "A rule-based approach for animating java algorithms",
                "authors": "N Sharaf, S Abdennadher, T Frühwirth",
                "citations": 13
              },
              {
                "title": "Eye-to-eye: towards visualizing eye gaze data",
                "authors": "Y Othman, M Khalaf, A Ragab, A Salaheldin, R Ayman, N Sharaf",
                "citations": 12
              }
            ],
            "citations": 356,
            "h_index": 268,
            "i10_index": 11
          },
          "research_insights": "## Research Profile Summary\n\n### Core Expertise\n- Visualization\n- Gamification\n- Smart Adaptive Education\n- Arabic Language Processing\n\n### Academic Impact\n- **Citation Metrics**: High H-index and total citations indicate significant impact in the field.\n- **Research Recognition**: Well-regarded for contributions in visualization, gamification, and education.\n- **Publication Focus**: Recent work focuses on developing serious games for teaching computational concepts and Arabic language processing.\n\n### Teaching & Mentoring Background\n- **Institutional Role**: Lecturer at German International University, German University in Cairo.\n- **Research Supervision**: Mentoring experience evident in publications on educational tools for children.\n- **Interdisciplinary Connections**: Bridges education, technology, and language processing in research.\n\n### Innovation Capacity\n- **Emerging Areas**: Exploring smart adaptive education and Industry 5.0.\n- **Collaboration Patterns**: Engages in interdisciplinary collaborations based on publication topics.\n- **Adaptability**: Demonstrated ability to work on diverse topics within technology and education.\n\n### Research Context\n- **Current Position**: Established researcher with a focus on educational technology and language processing.\n- **Network Potential**: Opportunities for collaborations in visualization, gamification, and education.\n- **Future Directions**: Likely to continue exploring innovative approaches in smart education and industry applications."
        }
      ],
      "user_inputs": [
        {
          "input": "i am a computer science lecturer teaching computer architecture, programming and oop (c++), discrete math, research methodology",
          "mode": "research",
          "timestamp": "2025-07-31T00:43:29.517852"
        },
        {
          "input": "i am a computer science lecturer teaching programming, oop (c++), data structures",
          "mode": "research",
          "timestamp": "2025-07-31T00:44:51.371122"
        },
        {
          "input": "i am a computer science lecturer teaching programming, oop (c++), data structures",
          "mode": "non-research",
          "timestamp": "2025-07-31T00:46:57.557765"
        },
        {
          "input": "i am a computer science lecturer teaching programming, oop (c++), data structures",
          "mode": "research",
          "timestamp": "2025-07-31T00:50:16.683997"
        }
      ]
    },
    "preferences": {},
    "statistics": {
      "topics_generated": 4,
      "documents_processed": 1,
      "scholar_profiles_analyzed": 1
    },
    "saved_topics": [
      {
        "id": "topic_1753915520525",
        "content": "                                Scope Rating MediumUniqueness Score 9Brief Overview This thesis explores the development of intelligent tutoring systems (ITS) tailored for teaching complex data structures concepts using gamification and adaptive learning techniques.Research Problem The research aims to address the challenge of effectively teaching data structures, a fundamental concept in computer science, by leveraging ITS capabilities to provide personalized, interactive, and engaging learning experiences.Mini Literature ReviewCurrent State of Research Existing research focuses on ITS in various educational domains but lacks specific applications for teaching data structures effectively.Key Studies Recent studies highlight the benefits of gamification in enhancing student engagement and learning outcomes in programming education.Limitations in Current Work The current research lacks a comprehensive ITS solution specifically designed for teaching data structures with adaptive learning features.Emerging Trends Emerging trends in smart education emphasize the need for personalized and interactive learning experiences, aligning with the proposed research direction.Research Gap The research aims to fill the gap in the literature by developing an ITS that integrates gamification elements and adaptive learning strategies to enhance the teaching and learning of data structures.Significance & Impact This research has the potential to revolutionize the way data structures are taught by providing personalized and engaging learning experiences, potentially improving student performance and understanding in this critical area of computer science.Key Research QuestionsHow can gamification elements be effectively integrated into an ITS for teaching data structures?What adaptive learning mechanisms are most effective in tailoring the learning experience for individual students?How does the use of an ITS impact student engagement and comprehension of complex data structures concepts?Methodology The research will involve the development of a prototype ITS, user testing with students, data collection on learning outcomes, and analysis of feedback to evaluate the effectiveness of the system.Expected Outcomes The research is expected to contribute a novel approach to teaching data structures, demonstrating the effectiveness of ITS with gamification and adaptive learning in improving student engagement and understanding.Prerequisites Proficiency in programming, familiarity with data structures concepts, and experience in educational technology research.Innovation Factor This topic introduces a novel application of ITS in the context of teaching data structures, combining gamification and adaptive learning to enhance student learning outcomes in a critical area of computer science education.                            ",
        "title": "Intelligent Tutoring Systems for Data Structures Learning",
        "keywords": [
          "intelligent tutoring systems",
          "data structures",
          "gamification",
          "adaptive learning",
          "smart education",
          "personalized learning",
          "interactive learning",
          "student engagement",
          "programming education",
          "ITS solution"
        ],
        "scope": "Medium",
        "uniqueness": 8,
        "created_at": "2025-07-31T00:45:20.525809",
        "mode": "research"
      },
      {
        "id": "topic_1753915832139",
        "content": "                                Scope Rating EasyUniqueness Score 8Brief Overview This thesis focuses on exploring the effectiveness of gamification strategies in improving the learning experience and understanding of Object-Oriented Programming (OOP) concepts, specifically using C++, among undergraduate students.Research Problem The research aims to address the challenge of engaging students and enhancing their comprehension of complex OOP concepts by incorporating gamification elements into the learning process, creating a more interactive and enjoyable educational experience.Mini Literature ReviewCurrent State of Research Existing studies have shown the benefits of gamification in education, but limited focus on its application to programming courses like OOP.Key Studies Recent research highlights the positive impact of gamified learning environments on student motivation and engagement in various subjects.Limitations in Current Work The lack of tailored gamification strategies for OOP courses may hinder students' ability to grasp abstract programming concepts effectively.Emerging Trends The increasing use of game-based learning approaches in education presents an opportunity to explore gamification in programming courses.Research Gap This research fills the gap in the literature by investigating the specific application of gamification strategies to enhance OOP learning, particularly in the context of C++ programming.Significance & Impact The findings of this research could lead to the development of more engaging and effective teaching methods for OOP courses, promoting better student outcomes and understanding of programming principles.Key Research QuestionsHow can gamification elements be integrated into OOP (C++) courses to enhance student engagement and learning outcomes?What impact do gamified learning environments have on students' motivation and understanding of complex OOP concepts?How do individual differences in gaming preferences influence the effectiveness of gamification in OOP education?Methodology The research will involve designing gamified learning modules for OOP courses, implementing these strategies in undergraduate classes, collecting student feedback, and analyzing the impact on learning outcomes through surveys and assessments.Expected Outcomes This research is expected to contribute to the development of innovative gamification strategies tailored for OOP (C++) education, providing insights into how game-based approaches can improve student learning experiences in programming courses.Prerequisites Basic knowledge of OOP concepts, familiarity with C++ programming language, and an interest in educational gamification.Innovation Factor This topic introduces a novel application of gamification strategies to enhance OOP learning, offering a unique approach to improving student engagement and comprehension in programming education.                            ",
        "title": "Gamification Strategies for Enhancing OOP (C++) Learning in Undergraduate Students",
        "keywords": [
          "gamification",
          "Object-Oriented Programming",
          "education",
          "programming courses",
          "game-based learning",
          "student engagement",
          "learning outcomes"
        ],
        "scope": "Medium",
        "uniqueness": 8,
        "created_at": "2025-07-31T00:50:32.139343",
        "mode": "research"
      }
    ]
  }
}